W12/w12d2/benchbnb/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "DDmzq3XfSgbR0E5DiEjtcQ"], ["updated_at", "2021-09-21 23:07:08.667146"], ["id", 1]]
---
  def reset_session_token!
    # When a user logs out, we want to scramble their session_token so that bad people cannot use the old one
    self.session_token = SecureRandom.urlsafe_base64
    self.save